yes, the problem is the `(known after apply)` value, which makes it hard to know, what exactly happens. I checked the plan file for any clues, but the only place, where you could get some information about what will happen is so broad that it doesn't help. So, at the moment I don't think we can support this kind of scenario without letting resources pass a lot of checks, because we would assume they will have a value after the apply.
```shell
  # aws_secretsmanager_secret.default will be created
  + resource "aws_secretsmanager_secret" "default" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + kms_key_id                     = (known after apply)
      + name                           = "test"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = (known after apply)

      + replica {
          + kms_key_id         = (known after apply)
          + last_accessed_date = (known after apply)
          + region             = (known after apply)
          + status             = (known after apply)
          + status_message     = (known after apply)
        }

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }
```
As seen here, it unclear what kind of values will be actually filled with a value.